#!/bin/bash

cat << "EOF"
                                                                    .         .                                 
8 8888888888   b.             8  8 8888     ,o888888o.             ,8.       ,8.                   .8.          
8 8888         888o.          8  8 8888    8888     `88.          ,888.     ,888.                 .888.         
8 8888         Y88888o.       8  8 8888 ,8 8888       `8.        .`8888.   .`8888.               :88888.        
8 8888         .`Y888888o.    8  8 8888 88 8888                 ,8.`8888. ,8.`8888.             . `88888.       
8 888888888888 8o. `Y888888o. 8  8 8888 88 8888                ,8'8.`8888,8^8.`8888.           .8. `88888.      
8 8888         8`Y8o. `Y88888o8  8 8888 88 8888               ,8' `8.`8888' `8.`8888.         .8`8. `88888.     
8 8888         8   `Y8o. `Y8888  8 8888 88 8888   8888888    ,8'   `8.`88'   `8.`8888.       .8' `8. `88888.    
8 8888         8      `Y8o. `Y8  8 8888 `8 8888       .8'   ,8'     `8.`'     `8.`8888.     .8'   `8. `88888.   
8 8888         8         `Y8o.`  8 8888    8888     ,88'   ,8'       `8        `8.`8888.   .888888888. `88888.  
8 888888888888 8            `Yo  8 8888     `8888888P'    ,8'         `         `8.`8888. .8'       `8. `88888. 

EOF

while true; do
    echo "Выберите необходимый шифр: "
    echo "1. Base64"
    echo "2. ROT 13"
    read cypher_
    if [ $cypher_ == "1" ]; then
        echo "Вы хотите зашифровать или расшифровать?"
        echo "1. Зашифровать"
        echo "2. Расшифровать"
        read enc_or_dec_
        if [ $enc_or_dec_ == "1"  ]; then
            read -p "Введите текст: " text_
            echo $text_ | base64
        elif [ $enc_or_dec_ == "2" ]; then
            read -p "Введите текст: " text_
            echo $text_ | base64 --decode
        fi
    fi
    if [ $cypher_ == "2" ]; then
        read -p "Если Вы хотите зашифровать или расшифровать, то введите текст: " text_
        echo $text_ | tr '[A-Za-z]' '[N-ZA-Mn-za-m]'
    fi
done
